In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.3.0'

In [4]:
dic1 = {
    "name" : ["a1", "a2", "a3"],
    "age" : [20, 21, 20]
    }

In [5]:
df = pd.DataFrame(dic1)
df

  name  age
0   a1   20
1   a2   21
2   a3   20

In [6]:
a = [1,2,3,4]
b = pd.Series(a)
print(b)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
b[0]

np.int64(1)

### chnage index

In [8]:
c = pd.Series(a, index=["a", "b", "c","d"])
c

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
c["a"]

np.int64(1)

In [10]:
d = {"a1": 1, "a2": 2, "a3": 3, "a4":4}
e = pd.Series(d)
print(e)

f = pd.Series(d, index=["a1","a2"])
f

a1    1
a2    2
a3    3
a4    4
dtype: int64

a1    1
a2    2
dtype: int64

### create dataframe

In [11]:
data = {
    "name": ["a1", "a2", "a3"],
    "age": [20, 21, 20]
}

In [12]:
df = pd.DataFrame(data)
df

  name  age
0   a1   20
1   a2   21
2   a3   20

In [13]:
df.loc[0]

name    a1
age     20
Name: 0, dtype: object

In [14]:
df.loc[[0,1]]

  name  age
0   a1   20
1   a2   21

In [15]:
df = pd.DataFrame(data, index=["d1", "d2", "d3"])
df

   name  age
d1   a1   20
d2   a2   21
d3   a3   20

In [16]:
df.loc["d1"]

name    a1
age     20
Name: d1, dtype: object

In [17]:
d1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
d1

a    1
b    2
c    3
d    4
dtype: int64

### dataframe

In [18]:
data = [["a1", 21],["a2", 20],["a3", 22]]
df = pd.DataFrame(data, columns=['name', 'age'])
df

  name  age
0   a1   21
1   a2   20
2   a3   22

In [19]:
data = {
    "name" : ["a1", "a2", "a3"],
    "age"  : [21, 20, 22]
}

df = pd.DataFrame(data)
df

  name  age
0   a1   21
1   a2   20
2   a3   22

In [20]:
df.to_csv('data.csv')

In [21]:
df.to_excel('data.xlsx')

### csv file

In [22]:
df = pd.read_csv('data.csv')

In [23]:
df = pd.read_excel('data.xlsx')

### view data

In [24]:
print(df.head(2))
print()
print(df.tail(2))

   Unnamed: 0 name  age
0           0   a1   21
1           1   a2   20

   Unnamed: 0 name  age
1           1   a2   20
2           2   a3   22

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3 non-null      int64
 1   name        3 non-null      object
 2   age         3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [26]:
df.describe()

       Unnamed: 0   age
count         3.0   3.0
mean          1.0  21.0
std           1.0   1.0
min           0.0  20.0
25%           0.5  20.5
50%           1.0  21.0
75%           1.5  21.5
max           2.0  22.0

### select data

In [27]:
df.columns

Index(['Unnamed: 0', 'name', 'age'], dtype='object')

In [28]:
#single column
age1 = df['age']
age1

0    21
1    20
2    22
Name: age, dtype: int64

In [29]:
#multiple column
a = df[['name', 'age']]
a

  name  age
0   a1   21
1   a2   20
2   a3   22

In [30]:
#raw by index
r1 = df.loc[0]
print(r1)

r2 = df.iloc[0]
r2

Unnamed: 0     0
name          a1
age           21
Name: 0, dtype: object

Unnamed: 0     0
name          a1
age           21
Name: 0, dtype: object

In [31]:
#condition
c = df[df['age']> 20]
c

   Unnamed: 0 name  age
0           0   a1   21
2           2   a3   22

### modify data

In [32]:
#new data
df['salary'] = [10000, 15000, 20000]
df

   Unnamed: 0 name  age  salary
0           0   a1   21   10000
1           1   a2   20   15000
2           2   a3   22   20000

In [33]:
#update data
df['age'] = df['age'] +1
df

   Unnamed: 0 name  age  salary
0           0   a1   22   10000
1           1   a2   21   15000
2           2   a3   23   20000

In [34]:
df.columns

Index(['Unnamed: 0', 'name', 'age', 'salary'], dtype='object')

In [35]:
#drop column
df = df.drop('salary', axis=1)
df

   Unnamed: 0 name  age
0           0   a1   22
1           1   a2   21
2           2   a3   23

In [36]:
df = df.drop(0)
df

   Unnamed: 0 name  age
1           1   a2   21
2           2   a3   23

In [58]:
#handle missing values
data = {
    "name" : ["a1", "a2", None],
    "age" : [20, None, 22]
}

df = pd.DataFrame(data)
df['salary'] = [10000, None, None]
df

   name   age   salary
0    a1  20.0  10000.0
1    a2   NaN      NaN
2  None  22.0      NaN

In [59]:
#to check missing values 
print(df.isna())

#fill missing values 
df['age'] = df['age'].fillna(df['age'].mean())
df['name'] = df['name'].fillna('Unknown')

print(df)
#drop colum which is null
df = df.dropna()
df

    name    age  salary
0  False  False   False
1  False   True    True
2   True  False    True
      name   age   salary
0       a1  20.0  10000.0
1       a2  21.0      NaN
2  Unknown  22.0      NaN

  name   age   salary
0   a1  20.0  10000.0

In [52]:
#grouping
df['dep'] = ['it', 'ai', 'it']
df

   name   age salary dep
0    a1  20.0   None  it
1    a2   NaN   None  ai
2  None  22.0   None  it

In [53]:
group = df.groupby('dep')['age'].mean()
group

dep
ai     NaN
it    21.0
Name: age, dtype: float64

In [ ]:
#merge data 
#1. by concat dataframe 
d1 = pd.DataFrame({ "name": ["a1"], "age": [20]})
d2 = pd.DataFrame({ "name": ["a2"], "age": [21]})
com = pd.concat([d1, d2], ignore_index=True)
com

  name  age
0   a1   20
1   a2   21

In [ ]:
#2. by merge  like sql on comomn column
d1 = pd.DataFrame({ "name": ["a1"], "age": [20], "id": [1]})
d2 = pd.DataFrame({ "id": [1], "salary": [20000]})
merge = pd.merge(d1, d2, on="id")
merge

  name  age  id  salary
0   a1   20   1   20000